УТ/src/DataProcessors/CRM_Приложения/CRM_Приложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_Приложения</name>
</mdclass:DataProcessor>

УТ/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_Приложения/Forms/ФормаФреш/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// -Рабочий стол

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияТелефонияНажатие(Элемент)
	
	ОткрытьТелефонию();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияFacebookНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерFacebook");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаInstagramНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерInstagram");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаInstagramDirectНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерInstagramDirect");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаTelegramНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерTelegram");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаTelegramБотНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерTelegramBot");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаWhatsAppНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерWhatsApp");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаВКонтактеНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерВКонтакте");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаViberНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерViber");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаСистемаВзаимодействияСообщенияНажатие(Элемент)
	ОткрытьВыбранныйСервис("МессенджерСистемаВзаимодействия");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаСистемаВзаимодействияНажатие(Элемент)
	
	Если ЕстьДоступКПодключениюСистемыВзаимодействия() Тогда
		Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/command/Обработка.сфпПодключениеСистемыВзаимодействия.Команда.Отключение");
		Иначе 
			ПерейтиПоНавигационнойСсылке("e1cib/app/Обработка.сфпПодключениеСистемыВзаимодействия");
		КонецЕсли;
	Иначе
		ОткрытьФорму("Обработка.сфпПодключениеСистемыВзаимодействия.Форма"); // Чтобы вышло системное сообщение о недостатке прав
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЕстьДоступКПодключениюСистемыВзаимодействия()
	Возврат ПравоДоступа("Использование", Метаданные.Обработки.сфпПодключениеСистемыВзаимодействия);
КонецФункции

&НаКлиенте
Процедура ОткрытьТелефонию()
	
	ИмяОткрываемойФормы = "Обработка.сфпАРМ_Телефония.Форма.Форма";
	Синоним = НСтр("ru='Телефония';en='Telephony'");
	
	Если CRM_РабочийСтолКлиент.ФормаОткрытаНаРабочемСтоле(ЭтотОбъект) Тогда
		ИндексФормы = CRM_РабочийСтолКлиент.ПолучитьИндексФормыРабочегоСтола(ЭтотОбъект, ИмяОткрываемойФормы);
		Если ИндексФормы = -1 Тогда
			ОткрытьФорму(ИмяОткрываемойФормы);
		Иначе
			CRM_РабочийСтолКлиент.АктивироватьФормуРабочегоСтола(ЭтотОбъект, ИмяОткрываемойФормы, ИндексФормы);
		КонецЕсли;
	Иначе
		ОткрытьФорму(ИмяОткрываемойФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыбранныйСервис(ИмяСервиса)
	
	Если СтрНайти(ИмяСервиса, "Мессенджер") > 0 Тогда
		СоздатьКаналДиалогов(СтрЗаменить(ИмяСервиса, "Мессенджер", ""));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - проверка наличия подключенных аккантов диалогов определенного типа
//
// Параметры:
//  ТипМессенджера - строка - название мессенджера
// 
// Возвращаемое значение:
//  Булево - Результат проверки. Истина, если есть элементы.
//
Функция ЕстьПодключенныеУчетныеЗаписиМессенджеров(ТипМессенджера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	               |ГДЕ
	               |	CRM_УчетныеЗаписиМессенджеров.Включена
	               |	И НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	               |	И CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = &ТипМессенджера";
	
	Запрос.УстановитьПараметр("ТипМессенджера", ТипМессенджера);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ЕстьПодключенныеУчетныеЗаписиМессенджеров()

&НаКлиенте
Процедура СоздатьКаналДиалогов(ТипМессенджера)

	УстановитьКонстанту("CRM_ИспользоватьИнтеграциюСМессенджерами");
	
	Канал = ЕстьПодключенныеУчетныеЗаписиМессенджеров(ТипМессенджера);
	Если Канал <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("ТекущаяСтрока", Канал);
		ОткрытьФорму("Справочник.CRM_УчетныеЗаписиМессенджеров.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		ПараметрыФормы = Новый Структура("ТипМессенджера", ТипМессенджера);
		ОткрытьФорму("Справочник.CRM_УчетныеЗаписиМессенджеров.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКонстанту(ИмяКонстанты)
	Если НЕ Константы[ИмяКонстанты].Получить() Тогда
		Константы[ИмяКонстанты].Установить(Истина);
	КонецЕсли;
КонецПроцедуры

// +Рабочий стол
#Область Подключаемый_РабочийСтол

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

#КонецОбласти
// -Рабочий стол

#КонецОбласти // СлужебныеПроцедурыИФункции
